src/seminars/sem2019_11_14/sem.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-11-16 Sat 22:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2019/11/14</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">2019/11/14</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org960980d">1. Синхронизация данных</a></li>
<li><a href="#orgaad6003">2. Первые скетчи на p5js</a>
<ul>
<li><a href="#org6f11289">2.1. <code>index.html</code></a></li>
<li><a href="#org8cc1d21">2.2. <code>sketch.js</code></a></li>
</ul>
</li>
<li><a href="#org6c21e38">3. Лог семинара</a>
<ul>
<li><a href="#org40f1cd6">3.1. Делаем скетч на p5js</a>
<ul>
<li><a href="#org5ef8842">3.1.1. С помощью npm через проект</a></li>
<li><a href="#org07f403b">3.1.2. На коленке создать html файл и js файл</a></li>
</ul>
</li>
<li><a href="#org4a4b9c2">3.2. <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-11-14 Thu 19:21&gt; </span></span> Настройка dat</a>
<ul>
<li><a href="#org632f2ea">3.2.1. В файлике <code>~/.npmrc</code> пишем:</a></li>
<li><a href="#orgb5fe633">3.2.2. Запускаем установку:</a></li>
</ul>
</li>
<li><a href="#orgcd344a3">3.3. Использование dat</a>
<ul>
<li><a href="#org5f41fbf">3.3.1. Как раздать контент:</a></li>
<li><a href="#orgc565f05">3.3.2. Как склонировать контент:</a></li>
<li><a href="#org8a7fc0d">3.3.3. Как запустить постоянную синхронизаци?</a></li>
</ul>
</li>
<li><a href="#org5be06fc">3.4. <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-11-14 Thu 19:53&gt; </span></span> Пишем скетч. 1-ый вариант</a>
<ul>
<li><a href="#org308fce5">3.4.1. <code>index.html</code></a></li>
<li><a href="#org05544dd">3.4.2. <code>sketch.js</code></a></li>
</ul>
</li>
<li><a href="#orgfe9c38e">3.5. <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-11-14 Thu 20:13&gt; </span></span> А dat то не работает!!!! Используем rsync</a></li>
<li><a href="#orga5f74fd">3.6. <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-11-14 Thu 20:33&gt; </span></span> Генерация ключей</a></li>
<li><a href="#org68f82a7">3.7. Собираем публичные ключи</a></li>
<li><a href="#orgbbda1c5">3.8. Теперь можно делать rsync без пароля <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-11-14 Thu 20:54&gt;</span></span></a></li>
<li><a href="#org56cff94">3.9. Запускаем rsync каждые 2 секунды</a></li>
<li><a href="#org7f771c2">3.10. <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-11-14 Thu 20:59&gt; </span></span> Ура!!! Синхонизация есть!</a></li>
<li><a href="#orga7809f6">3.11. https://p5js.org/reference/</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org960980d" class="outline-2">
<h2 id="org960980d"><span class="section-number-2">1</span> Синхронизация данных</h2>
<div class="outline-text-2" id="text-1">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2019-11-16 Sat&gt; </span></span> 
На семинаре выяснили, что dat-protocol по некоторым причинам не
работает у некоторых участников семинара. Как-нибудь потом я выясню
причину отказов у dat. А для успешного продолжения семинара было
принято решение перейти на <a href="https://en.wikipedia.org/wiki/Rsync">rsync</a>. Для этого потребовалось собрать у
участников публичные ключи и сохранить их не сервере. И тут возникли
определенные проблемы. Например у кого-то не работал copy-paste, а
писать 256-байтный ключ руками в текстовом редакторе на сервере было
совсем неразумно. После всех мучений была выработана следующая
схема:
</p>

<p>
Каждый участник запускает на своей машине <code>ssh-keygen</code>, который по
умолчанию генерирует в директории <code>~/.ssh</code> приватный <code>id_rsa</code> и
публичный <code>id_rsa.pub</code> ключи. 
</p>

<p>
Каждый участник пересылает на сервер свой публичный ключ, используя
пароль в качестве механизма авторизации:
</p>
<div class="org-src-container">
<pre class="src src-sh">scp ~/.ssh/id_rsa.pub mem@192.168.8.104:~/sem2019_11_14/&lt;&#1074;&#1072;&#1096;&#1077;_&#1080;&#1084;&#1103;&gt;.pub
</pre>
</div>

<p>
Все публичные ключи собираются в одном файле на сервере вот таким образом:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #00ffff;">for</span> a<span style="color: #00ffff;"> in</span> *.pub;
<span style="color: #00ffff;">do</span>
    cat $<span style="color: #7fffd4;">a</span> &gt;&gt; ~/.ssh/authorized_keys;
<span style="color: #00ffff;">done</span>
</pre>
</div>

<p>
После этой процедуры участники могут ходить на сервер по ssh без
пароля, но по ключу. Это то, что нужно для успешной автоматической
авторизации <code>rsync</code>.
</p>

<p>
Теперь осталось синхронизовать содержимое директории на сервере
с директорией на машине участника семинара:
</p>
<div class="org-src-container">
<pre class="src src-sh">watch -n 2 rsync --delete -avhze ssh mem@192.168.8.104:~/sem2019_11_14/ ~/sem2019_11_14
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaad6003" class="outline-2">
<h2 id="orgaad6003"><span class="section-number-2">2</span> Первые скетчи на p5js</h2>
<div class="outline-text-2" id="text-2">
<p>
Первый скетч мы решили сделать по <a href="https://p5js.org/get-started/">этому туториалу</a>. Правда в этом
туториале оказалась битая ссылка на <code>p5.min.js</code>. Сделав необходимую
правку ссылки мы получили два файлика:
</p>
</div>

<div id="outline-container-org6f11289" class="outline-3">
<h3 id="org6f11289"><span class="section-number-3">2.1</span> <a href="./sketch0/index.html"><code>index.html</code></a></h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #00fa9a; font-size: 110%; font-weight: bold;">html</span>&gt;
  &lt;<span style="color: #00fa9a; font-size: 110%; font-weight: bold;">head</span>&gt;
    &lt;<span style="color: #00fa9a; font-size: 110%; font-weight: bold;">script</span> <span style="color: #7fffd4;">src</span>=<span style="color: #ffc1c1;">"https://github.com/processing/p5.js/releases/download/0.10.2/p5.min.js"</span>&gt;&lt;/<span style="color: #00fa9a; font-size: 110%; font-weight: bold;">script</span>&gt;
    &lt;<span style="color: #00fa9a; font-size: 110%; font-weight: bold;">script</span> <span style="color: #7fffd4;">src</span>=<span style="color: #ffc1c1;">"sketch.js"</span>&gt;&lt;/<span style="color: #00fa9a; font-size: 110%; font-weight: bold;">script</span>&gt;
  &lt;/<span style="color: #00fa9a; font-size: 110%; font-weight: bold;">head</span>&gt;
  &lt;<span style="color: #00fa9a; font-size: 110%; font-weight: bold;">body</span>&gt;
  &lt;/<span style="color: #00fa9a; font-size: 110%; font-weight: bold;">body</span>&gt;
&lt;/<span style="color: #00fa9a; font-size: 110%; font-weight: bold;">html</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org8cc1d21" class="outline-3">
<h3 id="org8cc1d21"><span class="section-number-3">2.2</span> <a href="./sketch0/sketch.js"><code>sketch.js</code></a></h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #00ffff;">function</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">setup</span>() {
  createCanvas(640, 480);
}

<span style="color: #00ffff;">function</span> <span style="color: #00fa9a; font-size: 110%; font-weight: bold;">draw</span>() {
  <span style="color: #00ffff;">if</span> (mouseIsPressed) {
    fill(0);
  } <span style="color: #00ffff;">else</span> {
    fill(255);
  }
  ellipse(mouseX, mouseY, 80, 80);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6c21e38" class="outline-2">
<h2 id="org6c21e38"><span class="section-number-2">3</span> Лог семинара</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org40f1cd6" class="outline-3">
<h3 id="org40f1cd6"><span class="section-number-3">3.1</span> Делаем скетч на p5js</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org5ef8842" class="outline-4">
<h4 id="org5ef8842"><span class="section-number-4">3.1.1</span> С помощью npm через проект</h4>
</div>
<div id="outline-container-org07f403b" class="outline-4">
<h4 id="org07f403b"><span class="section-number-4">3.1.2</span> На коленке создать html файл и js файл</h4>
</div>
</div>

<div id="outline-container-org4a4b9c2" class="outline-3">
<h3 id="org4a4b9c2"><span class="section-number-3">3.2</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-11-14 Thu 19:21&gt; </span></span> Настройка dat</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org632f2ea" class="outline-4">
<h4 id="org632f2ea"><span class="section-number-4">3.2.1</span> В файлике <code>~/.npmrc</code> пишем:</h4>
<div class="outline-text-4" id="text-3-2-1">
<div class="org-src-container">
<pre class="src src-sh">prefix = ${<span style="color: #7fffd4;">HOME</span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb5fe633" class="outline-4">
<h4 id="orgb5fe633"><span class="section-number-4">3.2.2</span> Запускаем установку:</h4>
<div class="outline-text-4" id="text-3-2-2">
<div class="org-src-container">
<pre class="src src-sh">npm install -g dat
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcd344a3" class="outline-3">
<h3 id="orgcd344a3"><span class="section-number-3">3.3</span> Использование dat</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Договоримся об обозначениях:
</p>
<dl class="org-dl">
<dt>share<sub>dir</sub></dt><dd>директория, которую хотим пошарить</dd>
<dt>dat<sub>link</sub></dt><dd>dat ссылка</dd>
<dt>dest<sub>dir</sub></dt><dd>директория, куда клонируем контент</dd>
</dl>
</div>

<div id="outline-container-org5f41fbf" class="outline-4">
<h4 id="org5f41fbf"><span class="section-number-4">3.3.1</span> Как раздать контент:</h4>
<div class="outline-text-4" id="text-3-3-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b0c4de;">cd</span> share_dir
dat share
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc565f05" class="outline-4">
<h4 id="orgc565f05"><span class="section-number-4">3.3.2</span> Как склонировать контент:</h4>
<div class="outline-text-4" id="text-3-3-2">
<div class="org-src-container">
<pre class="src src-sh">dat clone dat_link dest_dir
</pre>
</div>
</div>
</div>

<div id="outline-container-org8a7fc0d" class="outline-4">
<h4 id="org8a7fc0d"><span class="section-number-4">3.3.3</span> Как запустить постоянную синхронизаци?</h4>
<div class="outline-text-4" id="text-3-3-3">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #b0c4de;">cd</span> dest_dir
dat sync
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5be06fc" class="outline-3">
<h3 id="org5be06fc"><span class="section-number-3">3.4</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-11-14 Thu 19:53&gt; </span></span> Пишем скетч. 1-ый вариант</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Создадим директорию <code>./sektch1</code>
</p>
<div class="org-src-container">
<pre class="src src-sh">mkdir sketch1
</pre>
</div>

<p>
В директории <code>./sketch1</code> надо создать два файлика
</p>
</div>
<div id="outline-container-org308fce5" class="outline-4">
<h4 id="org308fce5"><span class="section-number-4">3.4.1</span> <code>index.html</code></h4>
<div class="outline-text-4" id="text-3-4-1">
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #00fa9a; font-size: 110%; font-weight: bold;">html</span>&gt;
  &lt;<span style="color: #00fa9a; font-size: 110%; font-weight: bold;">head</span>&gt;
    &lt;<span style="color: #00fa9a; font-size: 110%; font-weight: bold;">script</span> <span style="color: #7fffd4;">src</span>=<span style="color: #ffc1c1;">"https://cdnjs.cloudflare.com/ajax/libs/p5.js/0.10.2/p5.js"</span>&gt;&lt;/<span style="color: #00fa9a; font-size: 110%; font-weight: bold;">script</span>&gt;
    &lt;<span style="color: #00fa9a; font-size: 110%; font-weight: bold;">script</span> <span style="color: #7fffd4;">src</span>=<span style="color: #ffc1c1;">"sketch.js"</span>&gt;&lt;/<span style="color: #00fa9a; font-size: 110%; font-weight: bold;">script</span>&gt;
  &lt;/<span style="color: #00fa9a; font-size: 110%; font-weight: bold;">head</span>&gt;
  &lt;<span style="color: #00fa9a; font-size: 110%; font-weight: bold;">body</span>&gt;
  &lt;/<span style="color: #00fa9a; font-size: 110%; font-weight: bold;">body</span>&gt;
&lt;/<span style="color: #00fa9a; font-size: 110%; font-weight: bold;">html</span>&gt;

</pre>
</div>
</div>
</div>

<div id="outline-container-org05544dd" class="outline-4">
<h4 id="org05544dd"><span class="section-number-4">3.4.2</span> <code>sketch.js</code></h4>
<div class="outline-text-4" id="text-3-4-2">
<div class="org-src-container">
<pre class="src src-js">
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfe9c38e" class="outline-3">
<h3 id="orgfe9c38e"><span class="section-number-3">3.5</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-11-14 Thu 20:13&gt; </span></span> А dat то не работает!!!! Используем rsync</h3>
<div class="outline-text-3" id="text-3-5">
<p>
На локальной машине создадим директорию <code>sem2019_11_14</code>:
</p>
<div class="org-src-container">
<pre class="src src-sh">mkdir sem2019_11_14
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">rsync --delete -avhze ssh mem@192.168.8.104:~/sem2019_11_14/ ~/sem2019_11_14
</pre>
</div>
</div>
</div>

<div id="outline-container-orga5f74fd" class="outline-3">
<h3 id="orga5f74fd"><span class="section-number-3">3.6</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-11-14 Thu 20:33&gt; </span></span> Генерация ключей</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Запустите ssh-keygen
</p>
<div class="org-src-container">
<pre class="src src-sh">ssh-keygen
</pre>
</div>

<p>
Ключики по умолчанию будут сохранены в директорию <code>~/.ssh</code>. Может, у
кого-то там уже есть ключи. В таком случае не надо делать новые.
</p>

<p>
Публичный ключ <code>id_rsa.pub</code> можете давать кому угодно, в том числе и
мне.
</p>
</div>
</div>

<div id="outline-container-org68f82a7" class="outline-3">
<h3 id="org68f82a7"><span class="section-number-3">3.7</span> Собираем публичные ключи</h3>
<div class="outline-text-3" id="text-3-7">
<div class="org-src-container">
<pre class="src src-sh">scp ~/.ssh/id_rsa.pub mem@192.168.8.104:~/sem2019_11_14/&lt;&#1074;&#1072;&#1096;&#1077;_&#1080;&#1084;&#1103;&gt;.pub
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #00ffff;">for</span> a<span style="color: #00ffff;"> in</span> *.pub; <span style="color: #00ffff;">do</span> cat $<span style="color: #7fffd4;">a</span> &gt;&gt; ~/.ssh/authorized_keys; <span style="color: #00ffff;">done</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbbda1c5" class="outline-3">
<h3 id="orgbbda1c5"><span class="section-number-3">3.8</span> Теперь можно делать rsync без пароля <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-11-14 Thu 20:54&gt;</span></span></h3>
</div>
<div id="outline-container-org56cff94" class="outline-3">
<h3 id="org56cff94"><span class="section-number-3">3.9</span> Запускаем rsync каждые 2 секунды</h3>
<div class="outline-text-3" id="text-3-9">
<div class="org-src-container">
<pre class="src src-sh">watch -n 2 rsync --delete -avhze ssh mem@192.168.8.104:~/sem2019_11_14/ ~/sem2019_11_14
</pre>
</div>
</div>
</div>

<div id="outline-container-org7f771c2" class="outline-3">
<h3 id="org7f771c2"><span class="section-number-3">3.10</span> <span class="timestamp-wrapper"><span class="timestamp">&lt;2019-11-14 Thu 20:59&gt; </span></span> Ура!!! Синхонизация есть!</h3>
</div>

<div id="outline-container-orga7809f6" class="outline-3">
<h3 id="orga7809f6"><span class="section-number-3">3.11</span> <a href="https://p5js.org/reference/">https://p5js.org/reference/</a></h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2019-11-16 Sat 22:13</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
